In [ ]:
import pandas as pd 
import sqlite3

In [ ]:
#Create table
connection = sqlite3.connect('mydb')
cursor = connection.cursor()

In [ ]:
cursor.execute( '''CREATE TABLE IF NOT EXISTS movies(name VARCHAR(50) PRIMARY KEY, year INT, boxoffice DOUBLE, director VARCHAR(70));''')
connection.commit()

In [ ]:
cursor.execute(''' INSERT INTO movies values('Terminator', 1984, 78.3, 'James Cameron'),('Predator', 1987, 98.3, 'John Mc Tiernal'),('Goodfellas', 1990, 47.1, 'Martin Scorsese'); ''')
connection.commit()

In [29]:
df = pd.read_sql_query('SELECT * FROM movies;', connection)
df

         name  year  boxoffice         director
0  Terminator  1984       78.3    James Cameron
1    Predator  1987       98.3  John Mc Tiernal
2  Goodfellas  1998       47.1  Martin Scorsese